narbiscorp/edge-earclip/firmware/sdkconfig.defaults
# Narbis earclip — ESP-IDF defaults.
# Pin: ESP-IDF v5.5.1 (see CLAUDE.md). Do not silently upgrade.

# ---------------- target ----------------
CONFIG_IDF_TARGET="esp32c6"

# ---------------- flash + partition table ----------------
# XIAO ESP32-C6 has 4 MB flash. The partition table assumes that size.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------- Bluetooth (NimBLE host) ----------------
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
# BLE controller modem-sleep. With this off (default in IDF 5.5), the BT
# controller holds an ESP_PM_CPU_FREQ_MAX lock 100% of the time, pinning
# the CPU at 160 MHz and blocking light sleep entirely (visible in
# esp_pm_dump_locks as "bt CPU_FREQ_MAX 100%"). Turning it on lets the
# controller dropthe lock between conn events. Sleep clock is the main
# XTAL by default (BT_LE_LP_CLK_SRC_MAIN_XTAL) — XIAO C6 has no
# external 32 kHz crystal.
CONFIG_BT_LE_SLEEP_ENABLE=y
# BLE light sleep requires the MAC and Baseband to power down with the
# rest of the system — without this the controller's sleep callback
# can't actually park the radio. Build error if BT_LE_SLEEP_ENABLE is
# set without this.
CONFIG_MAC_BB_PD=y
# Multi-central. Path B accepts 2 simultaneous centrals (dashboard + glasses);
# 3 leaves a slot for a debug client. Both host (NimBLE) and controller
# (LE) caps must be raised — host alone is a footgun (the controller will
# reject the third connect even though the host expected it to fit).
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_LE_MAX_CONNECTIONS=3

# ---------------- Power management ----------------
# Light sleep is the only sleep mode allowed (CLAUDE.md: no deep sleep on the
# earclip — incompatible with continuous sampling). Stage 07 wires up actual
# sleep entry; here we just enable the framework.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# Light-sleep / lock-holder profiling. esp_pm_dump_locks() prints which
# component is holding the CPU/APB at MAX. Enabled while we hunt down
# why average current is far above target.
CONFIG_PM_PROFILING=y
CONFIG_PM_DFS_INIT_AUTO=y
# Track total time spent in light sleep so we can verify it's actually
# entering. esp_pm_get_sleep_stats() (or the dump_locks output) reports it.
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# ---------------- Logging ----------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ---------------- Battery sense ----------------
# CI release binaries assume the 1 MΩ : 1 MΩ resistor divider is
# soldered (or breadboarded) on every Narbis earclip board, BAT+ →
# GPIO1 → GND, so power_mgmt_get_battery() reads real voltage instead
# of returning the 4000 mV / 80% stub. Boards without the divider will
# read random floating-pin values; for a fresh out-of-the-box XIAO,
# manually flip this back to n in a local `idf.py menuconfig` run
# before flashing.
#
# DIV_NUM/DIV_DEN here is a single project-wide multiplier. With ideal
# 1:1 resistors the math is 2/1; in practice tolerance + ADC bias
# pushes the reading ~3% low, so 33/16 (= 2.0625) lands the live
# bench-validated board within ±15 mV of bench across 3500–4200 mV.
# A future PR moves these into narbis_runtime_config_t (NVS-persisted,
# dashboard-tweakable, OTA-survivable) so each board can keep its own
# trim — until then the project default is the bench-calibrated 33/16.
CONFIG_NARBIS_BATT_DIVIDER_PRESENT=y
CONFIG_NARBIS_BATT_ADC_GPIO=1
CONFIG_NARBIS_BATT_ADC_DIV_NUM=33
CONFIG_NARBIS_BATT_ADC_DIV_DEN=16
